<h1> Exercice 1 </h1>

On vous a donné un ensemble de données nécessitant un nettoyage avant l'analyse. 

Le DataFrame df contient des informations sur des employés, y compris leur catégorie de travail, leur salaire, leur âge, le nombre de visites et leur évaluation.

Avec le DataFrame df fourni, effectuez les tâches suivantes de nettoyage de données :

1) Affichez les cinq premières et les cinq dernières lignes du DataFrame.
2) Obtenez le nombre total de lignes, la taille totale du DataFrame et sa forme.
3) Utilisez describe() pour obtenir un résumé statistique du DataFrame.
4) Réordonnez les colonnes en plaçant 'Employee' comme première colonne.
5) Renommez la colonne 'Category' en 'Department'.
6) Affichez les informations générales du DataFrame avec .info().
7) Vérifiez les types de données de chaque colonne avec dtypes et convertissez la colonne 'Salary' en type numérique.
8) Gérez les valeurs manquantes : identifiez-les, comptez-les, supprimez les lignes avec des valeurs manquantes dans 'Employee', et remplacez les valeurs manquantes dans 'Age' par la médiane.
9) Identifiez et supprimez les lignes en double, en gardant la première occurrence.
10) Remplacez toutes les occurrences de 'not available' dans 'Salary' par NaN.
11) Séparez la colonne 'Date' en deux colonnes distinctes 'Year' et 'Month' en utilisant .split('-').
12) Utilisez .apply() pour créer une nouvelle colonne 'Seniority' basée sur l'âge de l'employé : "Senior" pour plus de 40 ans, "Junior" pour moins.
13) Réinitialisez l'index.
14) Affichez le résumé final de .info() pour le DataFrame nettoyé.

In [2]:
import pandas as pd
from pathlib import Path

In [4]:
file_path = Path(r'C:\Users\nmako\Documents\Data-Science-Projects-Repository\Pandas_basic\data\raw\3_cleaning_data\employes.csv')
data = pd.read_csv(file_path)
df = data.copy()

In [7]:
#1. Afficher les premières et dernières lignes
print(df.head())
print()
print(df.tail())

         Date Category Employee     Salary   Age  Visits  Rating
0  2023-01-01  Finance    Frank   88416.95  40.0      42    3.69
1  2023-01-02   Health      Bob  100063.26  40.0      84    4.89
2  2023-01-03  Finance    Frank   92193.44  35.0      75    4.51
3  2023-01-04  Finance      NaN   88141.82  45.0      68    3.04
4  2023-01-05   Health    Alice   79655.84  35.0       6    1.22

          Date Category Employee     Salary   Age  Visits  Rating
28  2023-01-29      NaN    Frank   86529.38   NaN       0    3.21
29  2023-01-30   Health    Heidi   79026.34  45.0      50    1.66
30  2023-01-01  Finance    Frank   88416.95  40.0      42    3.69
31  2023-01-02   Health      Bob  100063.26  40.0      84    4.89
32         NaN  Finance    Frank   92193.44  35.0      75    4.51

In [11]:
# 2. Nombre de lignes, taille et forme
print(df.shape)

(33, 7)

In [18]:
# 3. Résumé statistique
(
    df
    .describe()
)

             Age     Visits     Rating
count  30.000000  33.000000  33.000000
mean   35.333333  54.727273   3.291515
std     6.814454  28.318802   1.249683
min    25.000000   0.000000   1.040000
25%    30.000000  41.000000   2.440000
50%    35.000000  58.000000   3.260000
75%    40.000000  76.000000   4.510000
max    45.000000  99.000000   4.920000

In [ ]:
# 4. Réordonner les colonnes

In [ ]:
# 5. Renommer la colonne

In [ ]:
# 6. Informations générales

In [ ]:
#7 Vérifiez les types de données de chaque colonne avec dtypes et convertissez la colonne 'Salary' en type numérique

In [ ]:
# 8. Gestion des valeurs manquantes

In [ ]:
# 9. Gestion des doublons

In [ ]:
# 10. Remplacer 'not available' par NaN

In [ ]:
# 11. Séparer la date

In [ ]:
# 12. Appliquer une fonction pour créer une nouvelle colonne

In [ ]:
# 13. Réinitialiser l'index

In [ ]:
#14 info